examples/lin_2024_tfln_120gops_tensor_core_surrogate.yaml
benchmark:
  name: Lin 2024 TFLN 120 GOPS tensor core surrogate
  description: Source-backed card for the Nature Communications 2024 thin-film lithium niobate photonic tensor core. The published device performs large fan-in neural-network layers; this config uses a 16x16 dense local matmul surrogate for comparison only.
workload:
  type: matmul
  m: 16
  n: 16
  k: 16
device:
  optical_mac_energy_fj: 0.5
  laser_wall_plug_efficiency: 0.25
  photodetector_energy_fj_per_sample: 10
  adc:
    bits: 8
    energy_pj_per_conversion: 0.5
  vector_dac:
    bits: 8
    energy_pj_per_conversion: 0.2
  weight_dac:
    bits: 8
    energy_pj_per_conversion: 0.2
execution:
  batch_size: 1
  vector_reuse_factor: 1
  weight_reuse_factor: 1
  weight_stationary: true
  pipeline:
    stages: 1
timing:
  optical_latency_ns: 1
  adc_latency_ns: 0
  dac_latency_ns: 0
noise:
  phase_noise_rad_rms: 0.02
  drift_rad_per_second: 0.1
  integration_time_ns: 1
provenance:
  source_title: 120 GOPS Photonic tensor core in thin-film lithium niobate for inference and in situ training
  source_url: https://www.nature.com/articles/s41467-024-53261-x
  doi: 10.1038/s41467-024-53261-x
  venue: Nature Communications 15, 9081 (2024)
  claim_status: paper-reported speed/training claims; matmul-surrogate local model
published_calibration:
  architecture: Thin-film lithium niobate integrated photonic tensor core
  reported_tops: 0.12
  additional_metrics:
    reported_gops: 120
    weight_update_speed_ghz: 60
    fan_in_dimension: 131072
    image_pixels: 12544
    physical_components_note: two TFLN modulators, III-V laser, and charge-integration photoreceiver
    surrogate_mapping: m=16, k=16, n=16 is a dense local surrogate for the large fan-in TFLN tensor core; not an exact time-domain integration schedule.
source_quality:
  reported_metrics:
    - throughput
    - weight_update_speed
    - fan_in
    - architecture
  local_surrogate_type: dense_tfln_fan_in_surrogate
  coverage:
    throughput: reported
    energy: not_reported
    accuracy: not_reported
    area: not_reported
    precision: not_reported
  confidence_grade: C
  notes:
    - Source-backed speed and fan-in evidence are present, but energy and task-quality coverage are not encoded in this card.
assumptions:
  - Source reports 120 GOPS computational speed and 60 GHz weight update speed; this card stores those values as published references.
  - Local workload and component energy values are PhotonicBench assumptions selected for comparable dense-card analysis.
  - Weight-stationary mode approximates reusing the surrogate right operand and does not model the paper's charge-integration schedule.